results/gcs_nvme/fio-rw:rw-rwmixread:66-numjobs:3-iodepth:3-bs:4k.out
fio-rw:rw-rwmixread:66-numjobs:3-iodepth:3-bs:4k: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=3
...
fio-3.28
Starting 3 processes
fio-rw:rw-rwmixread:66-numjobs:3-iodepth:3-bs:4k: Laying out IO file (1 file / 4096MiB)
fio-rw:rw-rwmixread:66-numjobs:3-iodepth:3-bs:4k: Laying out IO file (1 file / 4096MiB)
fio-rw:rw-rwmixread:66-numjobs:3-iodepth:3-bs:4k: Laying out IO file (1 file / 4096MiB)

fio-rw:rw-rwmixread:66-numjobs:3-iodepth:3-bs:4k: (groupid=0, jobs=3): err= 0: pid=2899: Mon Mar  4 19:42:15 2024
  read: IOPS=103k, BW=403MiB/s (423MB/s)(120GiB/303555msec)
    slat (nsec): min=1402, max=1888.6M, avg=11777.15, stdev=764628.75
    clat (usec): min=3, max=22531k, avg=36.62, stdev=14115.57
     lat (usec): min=7, max=22531k, avg=48.45, stdev=14136.25
    clat percentiles (usec):
     |  1.00th=[    7],  5.00th=[    7], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    9], 60.00th=[   10],
     | 70.00th=[   10], 80.00th=[   11], 90.00th=[   12], 95.00th=[   14],
     | 99.00th=[   74], 99.50th=[ 1172], 99.90th=[ 2245], 99.95th=[ 2343],
     | 99.99th=[ 2737]
   bw (  KiB/s): min=   24, max=1992064, per=100.00%, avg=743784.96, stdev=117688.01, samples=1010
   iops        : min=    6, max=498016, avg=185946.07, stdev=29422.02, samples=1010
  write: IOPS=53.2k, BW=208MiB/s (218MB/s)(61.6GiB/303555msec); 0 zone resets
    slat (nsec): min=1852, max=1144.2k, avg=3407.64, stdev=1593.38
    clat (usec): min=6, max=22271k, avg=43.51, stdev=17518.61
     lat (usec): min=8, max=22271k, avg=46.97, stdev=17518.61
    clat percentiles (usec):
     |  1.00th=[    7],  5.00th=[    7], 10.00th=[    7], 20.00th=[    8],
     | 30.00th=[    8], 40.00th=[    9], 50.00th=[    9], 60.00th=[   10],
     | 70.00th=[   10], 80.00th=[   11], 90.00th=[   12], 95.00th=[   14],
     | 99.00th=[   75], 99.50th=[ 1172], 99.90th=[ 2245], 99.95th=[ 2343],
     | 99.99th=[ 2769]
   bw (  KiB/s): min=   24, max=1026420, per=100.00%, avg=384043.92, stdev=60420.81, samples=1008
   iops        : min=    6, max=256605, avg=96010.75, stdev=15105.22, samples=1008
  lat (usec)   : 4=0.01%, 10=76.39%, 20=20.64%, 50=1.30%, 100=0.82%
  lat (usec)   : 250=0.05%, 500=0.03%, 750=0.06%, 1000=0.04%
  lat (msec)   : 2=0.47%, 4=0.21%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%, >=2000=0.01%
  cpu          : usr=9.03%, sys=16.01%, ctx=258704, majf=0, minf=76
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=31337937,16149580,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=3

Run status group 0 (all jobs):
   READ: bw=403MiB/s (423MB/s), 403MiB/s-403MiB/s (423MB/s-423MB/s), io=120GiB (128GB), run=303555-303555msec
  WRITE: bw=208MiB/s (218MB/s), 208MiB/s-208MiB/s (218MB/s-218MB/s), io=61.6GiB (66.1GB), run=303555-303555msec

Disk stats (read/write):
  nvme0n1: ios=395912/77575, merge=0/92, ticks=646881/24061300, in_queue=24711623, util=98.99%